# ElementMulticategoryFilter Constructor (ICollection(BuiltInCategory), Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementMulticategoryFilter Constructor (ICollection<(Of <(<'BuiltInCategory>)>)>, Boolean)
ElementMulticategoryFilter Class See Also
---
Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories,
	bool inverted
)
```

Visual Basic
---
```text
Public Sub New ( _
	categories As ICollection(Of BuiltInCategory), _
	inverted As Boolean _
)
```

Visual C++
---
```text
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories,
	bool inverted
)
```

# ### Parameters
categories
    Type: System.Collections.Generic..::..ICollection<(Of <(<'BuiltInCategory>)>)> The built-in categories to match.
inverted
    Type: System..::..Boolean True if the filter should match all elements which are not of the given built-in categories.
# See Also
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace